[
  {
      "joke": "What do you call a fake noodle?",
      "punchline": "An Impasta.",
      "why": "The humor is derived from the play on words, combining 'imposter' (a person who pretends to be someone else) and 'pasta'."
  },
  {
      "joke": "Why don't scientists trust atoms?",
      "punchline": "Because they make up everything.",
      "why": "This joke is based on a pun. 'Make up everything' refers to atoms being the basic building blocks of matter and also to the idea of fabrication or lying."
  },
  {
      "joke": "What do you call cheese that isn't yours?",
      "punchline": "Nacho cheese.",
      "why": "This joke is a play on words where 'nacho', a type of cheese, sounds like 'not yo’ (not your)."
  },
  {
      "joke": "What's orange and sounds like a parrot?",
      "punchline": "A carrot.",
      "why": "The humor comes from the similarity in sound between 'carrot' and 'parrot', despite being completely unrelated items."
  },
  {
      "joke": "How does a penguin build its house?",
      "punchline": "Igloos it together.",
      "why": "The punchline is a pun on 'igloos' sounding like 'glues', referencing the way penguins in cold climates might build homes."
  },
  {
      "joke": "What's brown and sticky?",
      "punchline": "A stick.",
      "why": "This joke relies on the dual meaning of 'sticky'—both as an adjective to describe how something feels and as a noun (stick)."
  },
  {
      "joke": "Why don’t skeletons fight each other?",
      "punchline": "They don’t have the guts.",
      "why": "This joke plays on the fact that skeletons lack internal organs ('guts'), while also using the idiomatic expression 'not having the guts' (not having the courage)."
  },
  {
      "joke": "What did one wall say to the other wall?",
      "punchline": "I’ll meet you at the corner.",
      "why": "This joke humorously personifies walls, suggesting they can meet and speak like humans, with a literal interpretation of meeting at a corner."
  },
  {
      "joke": "What do you call an alligator in a vest?",
      "punchline": "An investigator.",
      "why": "The joke is a pun on 'investigator', blending the words 'investigator' and 'alligator' in a whimsical way."
  },
  {
      "joke": "Why did the bicycle fall over?",
      "punchline": "Because it was two-tired.",
      "why": "This joke is a play on words. 'Two-tired' sounds like 'too tired', but it also refers to the two tires of a bicycle."
  }
]